"""
@author axiner
@version v1.0.0
@created 2024/7/29 22:22
@abstract
@description
@history
"""


class Versions:
    ALL = [
        ('1.3.0', 'opt@优化命令及提示'),
        ('1.2.9', 'fix@初始化顺序'),
        ('1.2.8', 'chg@命令升级'),
        ('1.2.7', 'opt@调整接口文档'),
        ('1.2.6', 'opt@文档注释'),
        ('1.2.5', 'opt@接口响应文档'),
        ('1.2.4', 'opt@优化命令'),
        ('1.2.3', 'chg@补充文档'),
        ('1.2.2', 'opt@优化接口文档生成'),
        ('1.2.1', 'opt@优化配置'),
        ('1.2.0', 'chg@升级安装包'),
        ('1.1.9', 'chg@文档调整'),
        ('1.1.8', 'opt@全面优化'),
        ('1.1.7', 'opt@调整配置'),
        ('1.1.6', 'opt@调试脚本'),
        ('1.1.5', 'opt@调整初始化'),
        ('1.1.4', 'opt@接口响应'),
        ('1.1.3', 'chg@调整接口响应'),
        ('1.1.2', 'chg@结构调整&依赖更新'),
        ('1.1.1', 'chg@文档完善'),
        ('1.1.0', 'add@项目初版'),
        ('1.0.0', 'init@...'),
    ]
